Revit 2027 API
Toposolid.Split Method
 Splits the Toposolid by the given curve loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> Split(
	IList<CurveLoop> splitCurveLoops
)
Public Function Split (
	splitCurveLoops As IList(Of CurveLoop)
) As IList(Of ElementId)
public:
IList<ElementId^>^ Split(
	IList<CurveLoop^>^ splitCurveLoops
)
member Split :
        splitCurveLoops : IList<CurveLoop> -> IList<ElementId>
Parameters
splitCurveLoops IList<CurveLoop>
 An array of planar curve loops that are used to split the Toposolid. All of the curve loops should lie on the sketch plane of the Toposolid.
Return Value
IList<ElementId>
 An array of newly created Toposolid ids after split.
Exceptions
Exception | Condition
ArgumentException |  The split curve loops should all lie on the sketch plane of the Toposolid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace